<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.lambda_functions.data.archive_file.daily_coffee: Reading...
module.lambda_functions.data.archive_file.populate_coffee_pool: Reading...
module.lambda_functions.data.archive_file.populate_coffee_pool: Read complete after 0s [id=230e7f2d094c856a5a11752253c2cec5f002caac]
module.lambda_functions.data.archive_file.daily_coffee: Read complete after 0s [id=bce823137b1bd5ebb42370a3957ec481144644eb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.api_app.aws_api_gateway_api_key.this will be created
  + resource "aws_api_gateway_api_key" "this" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = "API Key for general access to coffee run api"
      + enabled           = true
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "coffeerun-general"
      + tags_all          = (known after apply)
      + value             = (sensitive value)
    }

  # module.api_app.aws_api_gateway_deployment.this will be created
  + resource "aws_api_gateway_deployment" "this" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = (known after apply)
    }

  # module.api_app.aws_api_gateway_integration.get_daily_coffee will be created
  + resource "aws_api_gateway_integration" "get_daily_coffee" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.api_app.aws_api_gateway_integration.opt_daily_coffee will be created
  + resource "aws_api_gateway_integration" "opt_daily_coffee" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.api_app.aws_api_gateway_integration_response.opt_daily_coffee will be created
  + resource "aws_api_gateway_integration_response" "opt_daily_coffee" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'DELETE,GET,HEAD,OPTIONS,PATCH,POST,PUT'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api_app.aws_api_gateway_method.get_daily_coffee will be created
  + resource "aws_api_gateway_method" "get_daily_coffee" {
      + api_key_required = true
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api_app.aws_api_gateway_method.opt_daily_coffee will be created
  + resource "aws_api_gateway_method" "opt_daily_coffee" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api_app.aws_api_gateway_method_response.opt_daily_coffee will be created
  + resource "aws_api_gateway_method_response" "opt_daily_coffee" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api_app.aws_api_gateway_resource.daily_coffee will be created
  + resource "aws_api_gateway_resource" "daily_coffee" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "daily-coffee"
      + rest_api_id = (known after apply)
    }

  # module.api_app.aws_api_gateway_resource.root will be created
  + resource "aws_api_gateway_resource" "root" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "api"
      + rest_api_id = (known after apply)
    }

  # module.api_app.aws_api_gateway_rest_api.this will be created
  + resource "aws_api_gateway_rest_api" "this" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Main API for CoffeeRun App"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "coffeerun-prod-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)
    }

  # module.api_app.aws_api_gateway_stage.this will be created
  + resource "aws_api_gateway_stage" "this" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # module.api_app.aws_api_gateway_usage_plan.this will be created
  + resource "aws_api_gateway_usage_plan" "this" {
      + arn         = (known after apply)
      + description = "Usage plan for coffee run api"
      + id          = (known after apply)
      + name        = "coffeerun-general"
      + tags_all    = (known after apply)

      + api_stages {
          + api_id = (known after apply)
          + stage  = "prod"
        }
    }

  # module.api_app.aws_api_gateway_usage_plan_key.this will be created
  + resource "aws_api_gateway_usage_plan_key" "this" {
      + id            = (known after apply)
      + key_id        = (known after apply)
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = (known after apply)
      + value         = (known after apply)
    }

  # module.api_app.aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "daily_coffee-prod"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.dynamodb_tables.aws_dynamodb_table.coffee_pool will be created
  + resource "aws_dynamodb_table" "coffee_pool" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "coffee_id"
      + id               = (known after apply)
      + name             = "coffee_pool-prod"
      + range_key        = "tier"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "coffee_id"
          + type = "S"
        }
      + attribute {
          + name = "tier"
          + type = "S"
        }
    }

  # module.dynamodb_tables.aws_dynamodb_table.tier_list will be created
  + resource "aws_dynamodb_table" "tier_list" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "tier_id"
      + id               = (known after apply)
      + name             = "tier_list-prod"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "tier_id"
          + type = "S"
        }
    }

  # module.lambda_functions.aws_iam_policy.batchwrite_coffee_pool will be created
  + resource "aws_iam_policy" "batchwrite_coffee_pool" {
      + arn         = (known after apply)
      + description = "AWS IAM Policy for coffee_pool table batch write access"
      + id          = (known after apply)
      + name        = "terraform_dynamodb_batchwrite_policy-prod"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "dynamodb:BatchWriteItem"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:*:*:table/coffee_pool*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.lambda_functions.aws_iam_policy.cloudwatch_logs will be created
  + resource "aws_iam_policy" "cloudwatch_logs" {
      + arn         = (known after apply)
      + description = "AWS IAM Policy for cloudwatch logs access"
      + id          = (known after apply)
      + name        = "terraform_cloudwatch_logs_policy-prod"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.lambda_functions.aws_iam_policy.daily_coffee will be created
  + resource "aws_iam_policy" "daily_coffee" {
      + arn         = (known after apply)
      + description = "AWS IAM Policy for daily_coffee lambda role"
      + id          = (known after apply)
      + name        = "terraform_lambda_daily_coffee-prod"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "dynamodb:GetItem"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:*:*:table/tier_list*",
                          + "arn:aws:dynamodb:*:*:table/coffee_pool*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.lambda_functions.aws_iam_role.daily_coffee will be created
  + resource "aws_iam_role" "daily_coffee" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda_daily_coffee_role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.lambda_functions.aws_iam_role.populate_coffee_pool will be created
  + resource "aws_iam_role" "populate_coffee_pool" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda_populate_coffee_pool_role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_cloudwatch_logs will be created
  + resource "aws_iam_role_policy_attachment" "daily_coffee_cloudwatch_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda_daily_coffee_role-prod"
    }

  # module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_policy will be created
  + resource "aws_iam_role_policy_attachment" "daily_coffee_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda_daily_coffee_role-prod"
    }

  # module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_batchwrite_coffee_pool will be created
  + resource "aws_iam_role_policy_attachment" "populate_coffee_pool_batchwrite_coffee_pool" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda_populate_coffee_pool_role-prod"
    }

  # module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_cloudwatch_logs will be created
  + resource "aws_iam_role_policy_attachment" "populate_coffee_pool_cloudwatch_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda_populate_coffee_pool_role-prod"
    }

  # module.lambda_functions.aws_lambda_function.daily_coffee will be created
  + resource "aws_lambda_function" "daily_coffee" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../../modules/lambda_functions/daily_coffee/daily_coffee.zip"
      + function_name                  = "daily_coffee-prod"
      + handler                        = "daily_coffee.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "tmJHTThzzoS1I8SVJ3yr0AxyiK9gBLmkIwre3IVnx0k="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "COFFEE_POOL_TABLE_NAME" = "coffee_pool-prod"
              + "REGION"                 = "eu-south-2"
              + "TIER_LIST_TABLE_NAME"   = "tier_list-prod"
            }
        }
    }

  # module.lambda_functions.aws_lambda_function.populate_coffee_pool will be created
  + resource "aws_lambda_function" "populate_coffee_pool" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../../modules/lambda_functions/populate_coffee_pool/populate_coffee_pool.zip"
      + function_name                  = "populate_coffee_pool-prod"
      + handler                        = "populate_coffee_pool.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "nCNL6cIXdQcSw+NRA7H1Gz864jEvtshmTk8TPZf0A4M="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "COFFEE_POOL_TABLE_NAME" = "coffee_pool-prod"
              + "REGION"                 = "eu-south-2"
            }
        }
    }

Plan: 28 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @erikmichel-dev, Action: `pull_request`